{"data":{"markdownRemark":{"html":"<h1 id=\"how-i-overhauled-my-website-in-about-a-day\"><a href=\"#how-i-overhauled-my-website-in-about-a-day\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>How I Overhauled My Website in About a Day</h1>\n<p>I had been putting off redesigning my website for way too long. Everytime I thought, \"Dude, you <em>need</em> to update your site...like yesterday,\" I also remembered all of the steps that would take:</p>\n<ol>\n<li>Choose something to update like adding a new project.</li>\n<li>Go make sure the project looks good on GitHub and wherever it's hosted.</li>\n<li>Write up a short explanation for it.</li>\n<li>Screenshot it or pick a nice image to represent it.</li>\n<li>And <em>NOW</em> I can actually start the website update...by trying to remember my AWS password (my last host).</li>\n<li>After I give up on guessing my password, I go through the annoying process of resetting it.</li>\n<li>Now that I'm logged into my host, I'm ready to update my page - HTML &#x26; content - and upload the photo.</li>\n<li>If all goes well, that's it.</li>\n</ol>\n<p>Phew! I know I'm being a little dramatic and some of those steps could be simplified if I took the time to work on them, but it really was a burden that I didn't want to mess with.</p>\n<p>And that's why my site languished in its outdated state for a long time until one day I had...</p>\n<h2 id=\"an-important-conversation\"><a href=\"#an-important-conversation\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>An Important Conversation</h2>\n<p>As part of my growth as a developer, I try to meet up with other developers - especially people who are more experienced than I am.</p>\n<p>One such conversation was with a Senior Developer over coffee. In addition to getting his take on the market, finding out about what he did and what technologies he used, I also asked him about his suggestions for some typical development tasks. Specifically, what tech stacks he recommended for simple web sites - like my portfolio and blog.</p>\n<p>Since I had heard a lot about Gatsby recently, I asked what he thought about it and he encouraged me to try it out. The biggest thing he said was to spend no more than half a day or so. If you can't get it working by then, try something else.</p>\n<p>This seemed wise - what's half a day to maybe get my site updated and looking more sylish, right?</p>\n<h2 id=\"my-first-static-site-generator\"><a href=\"#my-first-static-site-generator\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>My First Static Site Generator</h2>\n<p>I know Gatsby is more than a static site generator, but for my site that's really all I needed from it. And its website was very encouraging:</p>\n<ol>\n<li>Install Gatsby.</li>\n<li>Start a new project from a template.</li>\n<li>Run <code class=\"language-text\">gatsby develop</code> to host a live-reloading version of your site locally as you edit.</li>\n<li>Run <code class=\"language-text\">gatsby build</code> to create the polished, web-ready version of your site.</li>\n</ol>\n<p>That is somewhat simplified, because I did have to choose a template, but that's the only other thing I needed to get off an running.</p>\n<h2 id=\"the-joy-of-editing-and-react\"><a href=\"#the-joy-of-editing-and-react\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The Joy of Editing and React</h2>\n<p>As I got into the groove of editing, it was awesome to see my site update on every file save. I've had this type of experience on CodePen and various other places, but Gatsby's version just works well.</p>\n<p>I also enjoyed how React was integrated into the project. Making changes to the actual layout or functionality of the site was easy because I'm very familiar with React - I use it at work right now and love it!</p>\n<p>Time flies as I enjoy the process of taking the template I started with and making it my own. Before I knew it, I was looking at a modern, professional version of my site - I was ready to show it to the world!</p>\n<h2 id=\"the-hiccups-begin\"><a href=\"#the-hiccups-begin\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The Hiccups Begin</h2>\n<p>And here is where I hit my first problem.</p>\n<p>When I went to build my site, the command failed! I had spent hours writing, sourcing images and taking screenshots, and tweaking the look of this site and now it was all going to be for nought!</p>\n<p>I hated how perfectly Gatsby had got me off and running only to dash my hopes near the end!</p>\n<p>But being a good developer, I started to troubleshoot. That is, I Googled the error code. It wasn't popular and most of the hits were from GitHub issues. I don't want to find out other people are having the same problem and they think it's the software itself...</p>\n<p>After some researching and back-tracking, I figured the problem must be that my starter template was for Gatsby v1 and I had installed the latest version - Gatsby v2. The docs had a process for converting a project from v1 to v2, but it looked long and tedious.</p>\n<p>More searching led me to a potential problem in one of Gatsby's dependencies used for CSS processing. I easily wasted an hour trying to bypass that part of the build to no avail.</p>\n<p>I want to take a moment to point out that somewhere in here would have been a good time to seek help from others. Finding a good place to get responsive help in working with Gatsby would have paid dividends both in getting a solution to my current problem and also in knowing where to go next time. I wanted to get the site finished quickly and I made myself feel like I didn't have time to wait for someone else to respond to my problem. I definitely think this was a mistake.</p>\n<h2 id=\"inspiration\"><a href=\"#inspiration\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Inspiration</h2>\n<p>I don't know when it hit me, but I finally considered another solution: Instead of trying to make my v1 Gatsby starter work with v2, why not just use Gatsby v1?</p>\n<p>I couldn't find documentation on the Gatsby website about how to choose an older version of Gatsby so it took me a while, but I eventually figured out the correct command to have npm install an older version of Gatsby. (In hindsight, I don't really blame the folks at Gatsby for this - if I'm going to use a tool like npm, I should probably figure out how to use it!)</p>\n<p>Sure enough, with that done I was building my site and happy as a clam.</p>\n<h2 id=\"tldr--aka-summary\"><a href=\"#tldr--aka-summary\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Tl;dr ( A.k.a. Summary)</h2>\n<p>I think I've reached a good length for this post so I'm going to cover deployment of the site in another post - stay tuned! Before leaving though, here's what I learned about redesigning a web site (or building from scratch):</p>\n<ul>\n<li>Use a static site generator and starter template or theme. Build off the work of others!</li>\n<li>Build it first! Sort out any problems before you start spending time on your own content.</li>\n<li>Give yourself time so you can ask others for help. I wanted to GET IT DONE and gave myself an unhelpful time crunch that eliminated seeking help from others.</li>\n<li>Enjoy the beauty of modern development tools!</li>\n</ul>","excerpt":"How I Overhauled My Website in About a Day I had been putting off redesigning my website for way too long. Everytime I thought, \"Dude, you…","frontmatter":{"title":"Post About Website","date":"2018.09.25","category":"Technology"},"timeToRead":5}},"pageContext":{"slug":"/post-about-website","prev":{"fields":{"slug":"/post-about-deploying-site"},"frontmatter":{"title":"Post About Deploying Site","category":"Development"}},"next":{"fields":{"slug":"/sound-technician-resources"},"frontmatter":{"title":"Sound Technician Resources","category":"Audio"}}}}